###  Part # 1
  #### Terraform Format and Style 🖌`failure`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/b4dcc4f0-503c-441d-8a8f-972496b5492e/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # local_file.lambda_src has been deleted
  - resource "local_file" "lambda_src" {
      - filename             = "lambda_function.py" -> null
        id                   = "5736b090cd453cd268c095628fbb59febe455df0"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "lambda_function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "lambda_function.py"
      + type                = "zip"
    }

  # aws_lambda_function.ec2_control will be updated in-place
  ~ resource "aws_lambda_function" "ec2_control" {
        id                             = "EC2_Control_Lambda"
      ~ last_modified                  = "2025-11-06T15:08:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "HgMj8Fo4eQsTbor8FxT0SILjMM9BqGJI/f6VCLe1Vxk=" -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.website_bucket will be created
  + resource "aws_s3_bucket" "website_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "EC2ondemandja2625"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "EC2ondemandja2625"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "EC2ondemandja2625"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_policy.website_policy will be created
  + resource "aws_s3_bucket_policy" "website_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_website_configuration.website will be created
  + resource "aws_s3_bucket_website_configuration" "website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "index.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

  # local_file.lambda_src will be created
  + resource "local_file" "lambda_src" {
      + content              = <<-EOT
            import json
            import boto3
            
            ec2 = boto3.client("ec2")
            
            TAG_KEY = "Environment"
            TAG_VALUE = "Dev"
            
            def list_instances():
                resp = ec2.describe_instances(
                    Filters=[{"Name": f"tag:{TAG_KEY}", "Values": [TAG_VALUE]}]
                )
                instances = []
                for r in resp["Reservations"]:
                    for i in r["Instances"]:
                        name = next((t["Value"] for t in i.get("Tags", []) if t.get("Key") == "Name"), i.get("InstanceId"))
                        instances.append({
                            "id": i["InstanceId"],
                            "name": name,
                            "state": i["State"]["Name"]
                        })
                return instances
            
            def lambda_handler(event, context):
                # Parse API Gateway HTTP API v2 body if it exists
                body = event.get("body")
                if body:
                    try:
                        data = json.loads(body)
                    except json.JSONDecodeError:
                        return {
                            "statusCode": 400,
                            "body": json.dumps({"error": "Invalid JSON in request body"})
                        }
                else:
                    data = event
            
                action = data.get("action")
                instance_id = data.get("instance_id")
            
                if action == "list":
                    return {"statusCode": 200, "body": json.dumps(list_instances())}
            
                if not instance_id:
                    return {"statusCode": 400, "body": json.dumps({"error": "No instance id provided"})}
            
                if action == "start":
                    ec2.start_instances(InstanceIds=[instance_id])
                    return {"statusCode": 200, "body": json.dumps({"message": f"Started {instance_id}"})}
            
                if action == "stop":
                    ec2.stop_instances(InstanceIds=[instance_id])
                    return {"statusCode": 200, "body": json.dumps({"message": f"Stopped {instance_id}"})}
            
                return {"statusCode": 400, "body": json.dumps({"error": "Invalid action"})}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "lambda_function.py"
      + id                   = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # local_file.lambda_src has been deleted%0A  - resource "local_file" "lambda_src" {%0A      - filename             = "lambda_function.py" -> null%0A        id                   = "5736b090cd453cd268c095628fbb59febe455df0"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.archive_file.lambda_zip will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "archive_file" "lambda_zip" {%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = "lambda_function.zip"%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_file         = "lambda_function.py"%0A      + type                = "zip"%0A    }%0A%0A  # aws_lambda_function.ec2_control will be updated in-place%0A  ~ resource "aws_lambda_function" "ec2_control" {%0A        id                             = "EC2_Control_Lambda"%0A      ~ last_modified                  = "2025-11-06T15:08:20.000+0000" -> (known after apply)%0A      ~ source_code_hash               = "HgMj8Fo4eQsTbor8FxT0SILjMM9BqGJI/f6VCLe1Vxk=" -> (known after apply)%0A        tags                           = {}%0A        # (20 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_s3_bucket.website_bucket will be created%0A  + resource "aws_s3_bucket" "website_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "EC2ondemandja2625"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "Dev"%0A          + "Name"        = "EC2ondemandja2625"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "Dev"%0A          + "Name"        = "EC2ondemandja2625"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # aws_s3_bucket_policy.website_policy will be created%0A  + resource "aws_s3_bucket_policy" "website_policy" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # aws_s3_bucket_website_configuration.website will be created%0A  + resource "aws_s3_bucket_website_configuration" "website" {%0A      + bucket           = (known after apply)%0A      + id               = (known after apply)%0A      + routing_rules    = (known after apply)%0A      + website_domain   = (known after apply)%0A      + website_endpoint = (known after apply)%0A%0A      + error_document {%0A          + key = "index.html"%0A        }%0A%0A      + index_document {%0A          + suffix = "index.html"%0A        }%0A    }%0A%0A  # local_file.lambda_src will be created%0A  + resource "local_file" "lambda_src" {%0A      + content              = <<-EOT%0A            import json%0A            import boto3%0A            %0A            ec2 = boto3.client("ec2")%0A            %0A            TAG_KEY = "Environment"%0A            TAG_VALUE = "Dev"%0A            %0A            def list_instances():%0A                resp = ec2.describe_instances(%0A                    Filters=[{"Name": f"tag:{TAG_KEY}", "Values": [TAG_VALUE]}]%0A                )%0A                instances = []%0A                for r in resp["Reservations"]:%0A                    for i in r["Instances"]:%0A                        name = next((t["Value"] for t in i.get("Tags", []) if t.get("Key") == "Name"), i.get("InstanceId"))%0A                        instances.append({%0A                            "id": i["InstanceId"],%0A                            "name": name,%0A                            "state": i["State"]["Name"]%0A                        })%0A                return instances%0A            %0A            def lambda_handler(event, context):%0A                # Parse API Gateway HTTP API v2 body if it exists%0A                body = event.get("body")%0A                if body:%0A                    try:%0A                        data = json.loads(body)%0A                    except json.JSONDecodeError:%0A                        return {%0A                            "statusCode": 400,%0A                            "body": json.dumps({"error": "Invalid JSON in request body"})%0A                        }%0A                else:%0A                    data = event%0A            %0A                action = data.get("action")%0A                instance_id = data.get("instance_id")%0A            %0A                if action == "list":%0A                    return {"statusCode": 200, "body": json.dumps(list_instances())}%0A            %0A                if not instance_id:%0A                    return {"statusCode": 400, "body": json.dumps({"error": "No instance id provided"})}%0A            %0A                if action == "start":%0A                    ec2.start_instances(InstanceIds=[instance_id])%0A                    return {"statusCode": 200, "body": json.dumps({"message": f"Started {instance_id}"})}%0A            %0A                if action == "stop":%0A                    ec2.stop_instances(InstanceIds=[instance_id])%0A                    return {"statusCode": 200, "body": json.dumps({"message": f"Stopped {instance_id}"})}%0A            %0A                return {"statusCode": 400, "body": json.dumps({"error": "Invalid action"})}%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "lambda_function.py"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 4 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @jangama3, Action: `pull_request`, Workflow: `Terraform`*